fonda-guo/MSPM0-BMS/Code/Comm/Header/BQ769x2_protocol.h
// Command Only Subcommands
#define EXIT_DEEPSLEEP 0x000E
#define DEEPSLEEP 0x000F
#define SHUTDOWN 0x0010
#define BQ769x2_RESET 0x0012  //"RESET" in documentation
#define PDSGTEST 0x001C
#define FUSE_TOGGLE 0x001D
#define PCHGTEST 0x001E
#define CHGTEST 0x001F
#define DSGTEST 0x0020
#define FET_ENABLE 0x0022
#define PF_ENABLE 0x0024
#define PF_RESET 0x0029
#define SEAL 0x0030
#define RESET_PASSQ 0x0082
#define PTO_RECOVER 0x008A
#define SET_CFGUPDATE 0x0090
#define EXIT_CFGUPDATE 0x0092
#define DSG_PDSG_OFF 0x0093
#define CHG_PCHG_OFF 0x0094
#define ALL_FETS_OFF 0x0095
#define ALL_FETS_ON 0x0096
#define SLEEP_ENABLE 0x0099
#define SLEEP_DISABLE 0x009A
#define OCDL_RECOVER 0x009B
#define SCDL_RECOVER 0x009C
#define LOAD_DETECT_RESTART 0x009D
#define LOAD_DETECT_ON 0x009E
#define LOAD_DETECT_OFF 0x009F
#define CFETOFF_LO 0x2800
#define DFETOFF_LO 0x2801
#define ALERT_LO 0x2802
#define HDQ_LO 0x2806
#define DCHG_LO 0x2807
#define DDSG_LO 0x2808
#define CFETOFF_HI 0x2810
#define DFETOFF_HI 0x2811
#define ALERT_HI 0x2812
#define HDQ_HI 0x2816
#define DCHG_HI 0x2817
#define DDSG_HI 0x2818
#define PF_FORCE_A 0x2857
#define PF_FORCE_B 0x29A3
#define SWAP_COMM_MODE 0x29BC
#define SWAP_TO_I2C 0x29E7
#define SWAP_TO_SPI 0x7C35
#define SWAP_TO_HDQ 0x7C40
#define MCR_REG 0x1228

#include "I2C_comm.h"
extern uint16_t AlarmBits;
extern uint8_t value_SafetyStatusA;
extern uint8_t value_SafetyStatusB;
extern uint8_t value_SafetyStatusC;
extern uint8_t value_SafetyStatusB;
extern uint8_t FET_Status;
extern int16_t Pack_Current;
extern uint16_t CellVoltage[8];
extern float Temperature[4];

void BQ769x2_Init(BatPackBasicInfo* packInfo);
void BQ769x2_ReadAlarmStatus();
void BQ769x2_ReadSafetyStatus();
void BQ769x2_ReadPFStatus();
uint16_t BQ769x2_ReadVoltage(uint8_t command);
void BQ769x2_ReadAllVoltages();
void BQ769x2_ReadCurrent();
float BQ769x2_ReadTemperature(uint8_t command);
void BQ769x2_ReadPassQ();
void BQ769x2_ReadFETStatus();
void BQ769x2_ReadAllTemperatures();
void CommandSubcommands(uint16_t command);
void DirectCommands(uint8_t command, uint16_t data, uint8_t type);
void BQ769x2_SetRegister(uint16_t reg_addr, uint32_t reg_data, uint8_t datalen);
void Temperature_Pin_Initialize(const uint16_t *temperatureIndex, uint8_t temperatureNum);
void VolMode_Initialize(const uint8_t* cellIndex, uint8_t cellNum);
#endif /* BQ769X2_PROTOCOL_H_ */
